package chapter3;

public class Chapter3 {
    public static void main(String[] args) {
        //중복코드

        //장황한 메서드

        //방대한 클라스

        //과다한 매개변수

        //수정의 산발

        //기능의 산재

        //잘못된 소속

        //데이터 뭉치

        //강박적 기본 타입 사용

        //switch 문

        //평행 상속 계측

        //직무유기 클라스

        //막연한 범용 코드

        //임시 필드

        //메세지 체인

        //과잉 중개 메서드

        //지나친 관여

        //인터페이스가 다른 대용 클라스

        //미흡한 라이브러리 클라스

        //데이터 클라스

        //방치된 상속물

        //불필요한 주석
    }
}
